Merge branch 'dev' into feature/hardware-kits
